In [1]:
import pandas as pd

In [6]:
indata = pd.read_csv("../dataset/customer.csv")

In [7]:
indata.columns = ["BA","ST","LA"]

In [8]:
indata.to_csv("../dataset/customer_out.csv", index = False)

In [10]:
pd.read_csv("../dataset/customer_out.csv")

              BA        ST       LA
0       30000000  22500000   normal
1      280000000  48000000  diamond
2      300000000  40666666  diamond
3       54000000  28000000   normal
4      768000000  32000000      vip
...          ...       ...      ...
19995  628000000  44666666  diamond
19996  276000000  20000000   normal
19997  652000000  41333333  diamond
19998  676000000  45333333  diamond
19999  732000000  26000000  diamond

[20000 rows x 3 columns]

In [4]:
pd.read_csv("../dataset/pipedata.txt", sep ="|")

   a  b  c
0  1  2  3
1  4  5  6

In [12]:
import psycopg2
import pandas as pd
from sqlalchemy import create_engine

In [14]:
indata = pd.read_csv("../dataset/kopo_product_volume.csv")

In [15]:
indata.columns = indata.columns.str.lower()

In [16]:
inId = "kopo"
inPw = "kopo"
inIp = "139.150.80.154"
inPort ="5432"
inDbName = "kopo"

In [19]:
postEngine = create_engine('postgresql://{}:{}@{}:{}/{}'.format(inId,inPw,inIp,inPort,inDbName))

In [22]:
resultName = "pgresult_hk"

In [23]:
indata.to_sql(name = resultName, con = postEngine, if_exists="replace", index = False)

265

In [26]:
conDb = pd.read_sql_query(sql = "select * from pgresult_hk", con = postEngine)

In [27]:
conDb

    regionid productgroup  yearweek  volume
0        A01       ST0001    201415  810144
1        A01       ST0002    201415  128999
2        A01       ST0001    201418  671464
3        A01       ST0002    201418  134467
4        A01       ST0001    201413  470040
..       ...          ...       ...     ...
260      A01       ST0002    201614  148835
261      A01       ST0001    201641  746061
262      A01       ST0002    201412  151750
263      A01       ST0001    201420  645626
264      A01       ST0002    201420  125863

[265 rows x 4 columns]

In [21]:
# PANDAS íŒ¨í‚¤ì§€ ë¶ˆëŸ¬ì˜¤ê¸°
import pandas as pd 
import pymysql 
from sqlalchemy import create_engine

In [26]:
inId = "kopo2"
inPw = "kopo2"
inIp = "139.150.80.154"
inPort ="3306"
inDbName = "kopo"

In [27]:
# DB ì»¤ë„¥ì…˜ ì—´ê¸°
engine_mariadb = create_engine('mysql+pymysql://{}:{}@{}:{}/{}'.format(inId,inPw,inIp,inPort,inDbName))

In [28]:
selloutData = pd.read_sql_query('SELECT * FROM kopo2', engine_mariadb)

In [29]:
selloutData

       AAAA   bbb
0  1SDSFJSK  11.0

In [30]:
selloutData.columns = ["NAME","INT"]

In [41]:
inId2 = "root"
inPw2 = "0000"
inIp2 = "192.168.110.1"
inPort2 ="3306"
inDbName2 = "web"

# DB ì»¤ë„¥ì…˜ ì—´ê¸°
engine_mariadb2 = create_engine('mysql+pymysql://{}:{}@{}:{}/{}'.format(inId2,inPw2,inIp2,inPort2,inDbName2))

In [42]:
engine_mariadb2

Engine(mysql+pymysql://root:***@192.168.110.1:3306/web)

In [43]:
selloutData.to_sql(name="yeah", con= engine_mariadb2)

1

In [35]:
resultName = "maria_iyyoo"
indata.to_sql(name = resultName, con = engine_mariadb2, if_exists="replace", index = False)

265